[
  {
    "id": "6357ce57bc0f627ab3f4a034",
    "img": "https://www.codespot.org/assets/css.jpg",
    "name": "CSS",
    "title": "Welcome To Learn CSS",
    "desciption": " * This course breaks down the fundamentals of CSS into digestible, easy to understand pieces. Over the next few modules, you'll learn how the core aspects of CSS work and how to use them effectively in your projects. Use the menu pane by the Learn CSS: logo to navigate the modules. ",
    "category_id": "1",
    "rating": [
      {
        "number": "4.6"
      }
    ]
  },
  {
    "id": "6357ce57d401ead8c72bc528",
    "img": "https://web-dev.imgix.net/image/T4FyVKpzu4WKF1kBNvXepbi08t52/uNe4OQfREZVVpnQOBxiA.png?auto=format",
    "name": "HTML",
    "desciption": "Nostrud deserunt ullamco aliquip incididunt nulla minim exercitation deserunt amet ullamco cupidatat dolor consequat. Dolor ad aute in veniam nostrud ea est esse quis excepteur. Consectetur quis aute ex occaecat culpa voluptate sint irure officia. Dolore veniam ex sit adipisicing adipisicing. Et nisi in proident sint.\r\n",
    "category_id": "2",
    "rating": [
      {
        "number": "4.6"
      }
    ]
  },
  {
    "id": "6357ce57a3144b35ee87d154",
    "img": "https://mpng.subpng.com/20180411/cvq/kisspng-javascript-html-computer-software-web-browser-watermark-5acdbd54ac19f7.4484983215234327887049.jpg",
    "name": "JAVASCRIPT",
    "desciption": "Lorem nisi aliquip quis magna aliquip. Esse aute in non duis deserunt ut exercitation ut in occaecat. Eu nisi amet commodo laboris magna. Laboris id sint sunt laboris sint esse commodo fugiat ut Lorem deserunt. Sunt laboris dolor irure laborum laboris. Dolor eu amet elit id cillum dolor.\r\n",
    "category_id": "3",
    "rating": [
      {
        "number": "4.8"
      }
    ]
  },
  {
    "id": "6357ce57f2242b2ce23cc837",
    "img": "https://miro.medium.com/max/1051/1*vHw6ENUfu71KHiyTm0BtUA.png",
    "name": "NODE_EXPRESS",
    "desciption": "In qui nulla excepteur consequat sit sit pariatur cillum ea irure cupidatat nisi cupidatat occaecat. Exercitation aliquip adipisicing et dolor adipisicing magna qui. Ullamco cillum sunt qui consequat nostrud veniam irure.\r\n",
    "category_id": "4",
    "rating": [
      {
        "number": "4.5"
      }
    ]
  },
  {
    "id": "6357ce5706bcbc6ab89dfb47",
    "img": "https://www.patterns.dev/img/reactjs/react-logo@3x.svg",
    "name": "REACT_JS",
    "desciption": "Nulla aliqua veniam culpa esse nulla amet ex et laborum. Reprehenderit incididunt magna reprehenderit tempor sit nulla commodo non velit dolor adipisicing excepteur officia officia. Veniam officia adipisicing deserunt ea officia do ea sint excepteur.\r\n",
    "category_id": "5",
    "rating": [
      {
        "number": "4.7"
      }
    ]
  },
  {
    "id": "6357ce57d23352f6fac97a96",
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmX3WjJjQRh2Plie5TbUPVeRTNbOAtGu_FIsV1FE_WQsywpsv9G8iHsxr3uJoD26gaPoo&usqp=CAU",
    "name": "PHP",
    "desciption": "Duis magna labore fugiat tempor. Magna fugiat qui do excepteur elit magna aute id in in voluptate est mollit. Mollit esse laborum eiusmod labore tempor mollit. Sit irure ad dolore elit consequat laborum sint do. Sunt dolore proident enim cupidatat deserunt sit cupidatat ut consectetur. Ipsum nostrud laboris irure in reprehenderit excepteur dolore deserunt consequat aliqua enim. Mollit dolore laboris incididunt ipsum dolor tempor Lorem consectetur aliqua esse.\r\n",
    "category_id": "6",
    "rating": [
      {
        "number": "4.4"
      }
    ]
  },
  {
    "id": "6357ce57a5cf8d549f3fda71",
    "img": "https://www.opc-router.de/wp-content/uploads/2021/03/mongodb_thumbnail.png",
    "name": "MONGODB",
    "desciption": "Et et est aliquip minim consectetur officia cillum consectetur ut consectetur reprehenderit aliqua. Elit cillum voluptate veniam tempor Lorem laborum dolor tempor enim elit. Occaecat mollit elit veniam nulla ad consectetur deserunt ex. Veniam officia cupidatat ad quis exercitation eu consequat velit ullamco ut enim eiusmod aute. Nostrud voluptate deserunt enim exercitation.\r\n",
    "category_id": "7",
    "rating": [
      {
        "number": "4.7"
      }
    ]
  },
  {
    "id": "6357ce576103d66e6fc7a6d6",
    "img": "https://image.shutterstock.com/image-vector/vector-illustration-icon-python-programming-260nw-1397241389.jpg",
    "name": "PYTHONE",
    "desciption": "Est quis magna velit sint tempor enim veniam nulla. Cillum nulla Lorem amet esse enim. Occaecat aliquip culpa reprehenderit consequat mollit commodo labore non.\r\n",
    "category_id": "8",
    "rating": [
      {
        "number": "4.8"
      }
    ]
  }
]